In [9]:
# import libreris
import numpy as np
import pandas as pd

In [10]:
# import dataset
df = pd.read_csv("Milk cheese and eggs prices.csv")
df

,Countries,"Milk, cheese, and eggs prices, 2017",Global rank,Available data
0,South Korea,227.69,1,2017 - 2017
1,Liberia,213.25,2,2017 - 2017
2,Montserrat,209.46,3,2017 - 2017
3,Bahamas,204.57,4,2017 - 2017
4,C.A. Republic,197.98,5,2017 - 2017
...,...,...,...,...
162,Poland,67.68,163,2017 - 2017
163,Belarus,65.82,164,2017 - 2017
164,Ukraine,62.54,165,2017 - 2017
165,Egypt,60.89,166,2017 - 2017
166,Tunisia,55.91,167,2017 - 2017

In [5]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 167 entries, 0 to 166
Data columns (total 4 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   Countries                            167 non-null    object
 1   Milk, cheese, and eggs prices, 2017  167 non-null    float64
 2   Global rank                          167 non-null    int64
 3   Available data                       167 non-null    object
dtypes: float64(1), int64(1), object(2)
memory usage: 5.3+ KB
None

In [12]:
df.describe()

       Milk, cheese, and eggs prices, 2017  Global rank
count                           167.000000    167.00000
mean                            116.792335     84.00000
std                              34.164710     48.35287
min                              55.910000      1.00000
25%                              93.625000     42.50000
50%                             107.890000     84.00000
75%                             137.525000    125.50000
max                             227.690000    167.00000

In [16]:
#Rename Columns for Clarity
df.columns = ['Country', 'Price_2017', 'Global_Rank', 'Available_Data']

In [17]:
#Drop Irrelevant Column
df.drop(columns=['Available_Data'], inplace=True)

In [18]:
#Check for Missing Values
print(df.isnull().sum())

Country        0
Price_2017     0
Global_Rank    0
dtype: int64

In [19]:
# Drop Duplicate Rows (if any)
df = df.drop_duplicates()

In [20]:
print(df.head())

         Country  Price_2017  Global_Rank
0    South Korea      227.69            1
1        Liberia      213.25            2
2     Montserrat      209.46            3
3        Bahamas      204.57            4
4  C.A. Republic      197.98            5

In [21]:
#Save the Cleaned Dataset
df.to_csv("cleaned_food_prices.csv", index=False)